In [3]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [38]:
#creation from a dict
data = {'state':['ohio', 'ohio', 'ohio', 'Nevada', 'Nevada'], \
        'year':[2000, 2001, 2002, 2001, 2002], \
        'pop':[1.5, 1.7, 3.6, 2.4, 2.9]}
DataFrame(data, columns=['year', 'State', 'Pop'])

   year State  Pop
0  2000   NaN  NaN
1  2001   NaN  NaN
2  2002   NaN  NaN
3  2001   NaN  NaN
4  2002   NaN  NaN

In [39]:
frame = DataFrame(np.arange(16).reshape((4,4)),\
                  index = ['Ohio', 'Colorado', 'Utah', 'New York'], \
                  columns = ['one', 'two', 'three', 'four'])
frame

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [25]:
#Select rows by slicing
#Select row 0,1
frame[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [28]:
#Select a column
#SELECT 'three' FROM frame;
frame['three']

Ohio         2
Colorado     6
Utah        10
New York    14
Name: three, dtype: int64

In [71]:
#Select rows by filtering (passing a boolean array)
#SELECT * FROM frame WHERE 'three' > 5;
print frame[frame.ix[:,2] > 5]
print frame[frame['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [37]:
#obj.ix[...] is like retrieving by coordinates, coordinates are specified (row_index, column_index).
#both coordiates can be numerical values or names, or ranges of numerical values/names
#obj.ix[x, y], x specifies index coordinate, y specifies column coordinate
#obj.ix[x]: when there is only one argument, the argument specifies index coordinate
#select a single row (row whose  is 2)
frame.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [72]:
#select a single column (column whose internal index is 2)
frame.ix[:,2]

Ohio         2
Colorado     6
Utah        10
New York    14
Name: three, dtype: int64

In [74]:
#can access 
frame.ix[:,2][2]

10

In [41]:
frame.ix[2,2]

10

In [48]:
#lexicographical sorting by index or column NAMES (AS APPOSED TO SORTING BY VALUES)
#frame.sourt_index(axis=<0 or 1>, ascending=<True or False>)
#frame.sort_index(axis=0) sort by index names, if argument is not specified, default is axis = 0
#frame.sort_index(axis=1) sort by column names,
frame.sort_index(axis=1, ascending=False)

          two  three  one  four
Ohio        1      2    0     3
Colorado    5      6    4     7
Utah        9     10    8    11
New York   13     14   12    15

In [52]:
#sorting by column values: frame.sort_values(by='<column_name'>, ascending=<True or False)
#SELECT * FROM frame ORDER BY 'one' DESC;
frame.sort_values(by='one', ascending=False)

          one  two  three  four
New York   12   13     14    15
Utah        8    9     10    11
Colorado    4    5      6     7
Ohio        0    1      2     3

In [53]:
#SELECT 'one' FROM frame ORDER BY 'one';
frame.sort_values(by='one')['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int64

In [54]:
#SELECT * FROM frame ORDER BY 'one', 'two';
frame.sort_values(by=['one', 'two'])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [31]:
#scalar comparison
frame < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [61]:
#summing over columns
#SELECT SUM(*) FROM frame
frame.sum()

one      24
two      28
three    32
four     36
dtype: int64

In [62]:
#summing over rows
frame.sum(axis=1)

Ohio         6
Colorado    22
Utah        38
New York    54
dtype: int64

In [66]:
#describe: gives column statistics
frame.describe()

             one        two      three       four
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [ ]:
#df.iterrows() return series -- it creates a new series for each iteration. slow.
#df.itertuples() itertuples return a numpy array. faster.

for row in mopex_mini[(mopex_mini['RA']>285.753) & (mopex_mini['RA']<285.760) & (mopex_mini['DEC']>8.24)].itertuples():
    print row